import pandas as pd
import numpy as np

df = pd.DataFrame({'Planet Name': ['Меркурий', 'Венера', 'Земля', 'Марс', 'Юпитер', 'Сатурн', 'Уран', 'Нептун'],
        'Diameter(km)': [4879, 12104, 12756, 6756, 142984, 120536, 51118, 49528],
        'Rotation Period(In Earth Days)': [58.66, 243, 1, 1.03, 0.42, 0.45, 0.71, 0.67],
        'Revolution Periods(In Earth Days)': [88, 224, 365.25, 687, 4332, 10775, 30681, 60193],
        'Surface Composition': ['Каменистый', 'Каменистый', 'Каменистый', 'Каменистый', 'Газовый', 'Газовый', 'Газовый', 'Газовый'],
        'Moons': [0, 0, 1, 2, 60, 31, 27, 13],
        'Rings': ['Отсутствуют', 'Отсутствуют', 'Отсутствуют', 'Отсутствуют', 'Присутствуют', 'Присутствуют', 'Присутствуют', 'Присутствуют']})
df.head(3)

df.tail(3)

df.to_csv('Planets.csv', index=False)

pd.read_csv('/content/Planets.csv')
